"use client"
import React from "react"
import styles from "@/styles/Rules/Rules.module.scss"
import Image from "next/image"
import Img from "@/images/enderman.gif"
import { motion, useScroll } from "framer-motion"

const Rules = () => {
  const { scrollY } = useScroll()
  return (
    <section>
      <div className={styles.mainWrapper}>
        <div className={styles.left}>
          <div className={styles.blockWrapper}>
            <ul>
              <li>
                Правила – свод положений и рекомендаций, регулирующих
                деятельность пользователей в игре. Каждый зарегистрированный
                пользователь обязан соблюдать правила
              </li>
              <li>
                Флуд – часто повторяющиеся, либо не имеющие смысловой нагрузки
                сообщения (3 и более сообщений подряд).
              </li>
              <li>Спам – ненужные адресату послания рекламного характера.</li>
              <li>Бан – ограничение доступа пользователя к игровому серверу</li>
              <li>Кик – отключение игрока от игрового сервера.</li>
              <li>Мут – ограничение доступа пользователя к игровому чату.</li>
              <li>
                Приватные чаты – личные сообщения которые не видят другие игроки
              </li>
            </ul>
            <p>
              Члены Модераторского состава сервера вправе выдавать наказание без
              предупреждения и выбирать меру наказания, основываясь на
              сложившейся ситуации, игнорируя рамки, указанные в правилах.
              Степень адекватности наказания оценивается старшим составом
              сервера.
            </p>
            <p>
              Здравый смысл (практический, жизненный ум человека, позволяющий
              ему успешно решать разнообразные жизненные проблемы без
              специального образования или без соответствующей профессиональной
              подготовки) превыше любого правила. В случае если правила ему
              противоречат, решения основываются именно на нём.
            </p>
          </div>
          <div className={styles.blockWrapper}>
            <h1>1. Общие правила</h1>
            <ul className={styles.block}>
              <li>
                1.1. Любой человек, зарегистрировавшийся на проекте, соглашается
                со всеми правилами, перечисленными ниже, а также с политикой по
                обработке персональных данных. Незнание правил не освобождает
                пользователя от ответственности.
              </li>
              <li>
                1.2. Вы сами несете ответственность за безопасность своего
                аккаунта и обязуетесь соблюдать все надлежащие меры по
                обеспечению его безопасности. Взлом аккаунта не является
                оправданием, если игрок обвиняется в нарушении правил.
              </li>
              <li>
                1.3. Сервис бесплатен и предоставляется без каких–либо гарантий
                правильной работы. Администрация оставляет за собой право не
                возвращать вещи, потерянные в результате бага, отката, смерти
                игрока, нестабильной работы серверов и т.п.
              </li>
              <li>
                1.4. При блокировке аккаунта все игровые ценности (предметы в
                инвентаре, территория, содержимое сундуков и прочее) возврату и
                передаче не подлежат.
              </li>
              <li>
                1.5. Администрация (Гл. Модератор в том числе) имеет право
                вмешиваться в игровой процесс в любое время в том случае, если
                возникают следующие ситуации: угроза нормальной
                работоспособности сервера/проекта, помеха комфортной среде для
                игроков и т.п.
              </li>
              <li>
                1.6. Администрация в случае крайней необходимости имеет право
                изъять любые игровые ценности игрока, если: игровая ценность
                может навредить стабильной работе сервера и экономике; игровые
                ценности были получены нечестным путем или в результате ошибки в
                работе сервера;
              </li>
              <li>
                1.7. Запрещена реклама и упоминание сторонних проектов в любом
                её виде.
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 часа.
                </p>
              </li>
              <li>
                1.8. Запрещено регистрировать никнеймы и устанавливать префиксы,
                прямо или косвенно нарушающие другие пункты правил, а также:
                <ul>
                  <li>носящие эротический или аморальный характер;</li>
                  <li>
                    содержащие явную отсылку к модерации или администрации
                    проекта.
                  </li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span> Ник:
                  Перманентная блокировка аккаунта. Префикс: Сброс префикса. При
                  злоупотреблении: мут.
                </p>
              </li>
              <li>
                1.9. Запрещено устанавливать скины и плащи:
                <ul>
                  <li>
                    содержащие надписи с оскорблениями или нецензурными
                    выражениями;
                  </li>
                  <li>носящие порнографический характер;</li>
                  <li>
                    содержащие в себе любые политические, националистические или
                    военные символы и связи;
                  </li>
                  <li>
                    представляющие собой нацистскую или дискриминационную
                    символику и смысл.
                  </li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан на 1 час.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> – бан
                  от 1 до 7 дней.
                </p>
              </li>
              <li>
                1.10. Запрещено лжесвидетельствовать против игроков, подделывать
                доказательства, шантажировать доказательствами нарушения игрока.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан на 7 дней.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> – бан
                  от 7 до 30 дней.
                </p>
              </li>
              <li>
                1.11. Жалобы на нарушения должны быть поданы не позднее 48-ми
                часов с момента фиксации.
              </li>
              <li>
                1.12. Запрещено покупать или продавать игровые ресурсы, игровой
                аккаунт, предоставлять прочие услуги за реальные деньги или в
                обмен на другие ценности, не связанные с проектом. Запрещено
                передавать данные аккаунта третьим лицам и использовать аккаунты
                третьих лиц.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  перманентный бан.
                </p>
              </li>
              <li>
                1.13. Правила создания и использования мультиаккаунтов:
                Запрещено создавать мультиаккаунты для:
                <ul>
                  <li>прохождения квестов для получения ресурсов;</li>
                  <li>собственного обогащения;</li>
                  <li>намеренного нарушения правил.</li>
                </ul>
                Если у игрока имеется уже забаненный аккаунт, то модерация
                вправе банить последующие аккаунты игрока на максимально
                возможный срок.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  Перманентный бан твинк-аккаунта.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> –
                  перманентный бан всех аккаунтов.
                </p>
              </li>
              <li>
                1.14. Средства, потраченные на донат, идут на развитие проекта
                (разработка, модернизация и поддержка интернет-проекта) и не
                могут быть возвращены ни при каких обстоятельствах.
              </li>
              <li>
                1.15. В случае необходимости игрок может быть временно забанен
                модерацией на время разрешения инцидента с нарушением правил.
              </li>
              <li>
                1.16. За чрезмерно частые и регулярные нарушения правил вы и все
                ваши твинк аккаунты могут быть забанены навсегда.
              </li>
            </ul>
          </div>
          <div className={styles.blockWrapper}>
            <h1>2. Игровой процесс</h1>
            <ul className={styles.block}>
              <li>
                2.1. Регулировка отношений внутри региона происходит самими
                игроками (если вы добавляете игрока в регион, он имеет полное
                право забрать все ваши ресурсы).
              </li>
              <li>
                2.2. Игрок не обязан возвращать потерянные в PvP или же случайно
                выброшенные вами вещи.
              </li>
              <li>
                2.3. Запрещено:
                <ul>
                  <li>
                    использовать, распространять или обсуждать изменения файлов
                    клиента игры, дюпы, ошибки (баги) в работе серверов и любые
                    сторонние программы, дающие дополнительные преимущества в
                    игре или наносящие вред игровому процессу и серверам;
                  </li>
                  <li>
                    использовать, распространять, хранить предметы, добытые
                    нечестным путем.
                  </li>
                </ul>
              </li>
              <li>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 7 до 360 дней.
                </p>
              </li>
              <li>
                2.3.1. Все игроки, замеченные в помощи, либо состоявшие в
                регионе, на котором происходил дюп, наказываются в соответствии
                правил так же, как и человек, которого забанили за нарушение
                правила 2.3.
              </li>
              <li>
                2.4. Запрещено:
                <ul>
                  <li>
                    вводить в заблуждение игроков с целью получения собственной
                    выгоды;
                  </li>
                  <li>вводить в заблуждение представителей администрации;</li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 7 до 180 дней;
                </p>
                <ul>
                  <li>
                    выдавать себя за должностное лицо проекта/сервера, если вы
                    таковым не являетесь.
                  </li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 3 до 7 дней.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> – бан
                  от 7 до 30 дней.
                </p>
              </li>
              <li>
                2.5. Запрещено совершать любые действия, направленные на
                дестабилизацию экономики сервера.
              </li>
              <p>
                <span className={styles.punishment}>Наказание: </span> бан от 1
                до 7 дней.{" "}
              </p>
              <p>
                <span className={styles.repeated}>При рецидиве </span> – бан от
                7 до 30 дней.
              </p>

              <li>
                2.6. В названиях предметов, варпов и животных запрещено
                использовать:
                <ul>
                  <li>оскорбления и нецензурные выражения;</li>
                  <li>
                    ники игроков и префиксы назначенного модераторского состава;
                  </li>
                  <li>
                    любые политические, националистические или военные символы и
                    связи.
                  </li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан на 1 день и удаление предмета, варпа, животного.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> – бан
                  от 1 до 7 дней.
                </p>
              </li>
              <li>
                2.7. Запрещено наносить вред чужим постройкам, в том числе:
                <ul>
                  <li>
                    приносить вред чужим постройкам с помощью поршней, разлива
                    воды, лавы и прочих жидкостей;
                  </li>
                  <li>
                    убивать мирных животных в загонах/выталкивать животных из
                    загонов;
                  </li>
                  <li>
                    намеренно блокировать доступ к чужим сооружениям, выстраивая
                    глухие стены, вырывая окопы, разливая жидкости;
                  </li>
                  <li>уничтожать чужие посевы;</li>
                  <li>
                    создавать регионы впритык к чужим регионам с целью навредить
                    игровому процессу.
                  </li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> – бан
                  от 7 до 30 дней.
                </p>
              </li>
              <li>
                2.8. Запрещено публичное размещение объектов:
                <ul>
                  <li>прямо или косвенно нарушающие правила проекта;</li>
                  <li>носящие порнографический или аморальный характер;</li>
                  <li>
                    содержащих в себе оскорбления или нецензурные выражения;
                  </li>
                  <li>
                    содержащие в себе любые политические, националистические или
                    военные символы и связи;
                  </li>
                  <li>
                    представляющие собой нацистскую или дискриминационную
                    символику и смысл.
                  </li>
                </ul>
              </li>
              <p>
                <span className={styles.punishment}>Наказание: </span>
                Снос постройки. Предупреждение или бан от 1 часа до 2 дней.
              </p>
              <p>
                <span className={styles.repeated}>При рецидиве </span> – бан до
                7 дней.
              </p>

              <li>2.9. Запрещено намеренно портить внешний вид карты.</li>
              <p>
                <span className={styles.punishment}>Наказание: </span>
                бан на 1 час.
              </p>
              <p>
                <span className={styles.repeated}>При рецидиве </span> – бан на
                1 день.
              </p>

              <li>
                2.10. Запрещено каким-либо образом обходить защиту системы
                приватов. Например, случаи, когда один игрок украл ресурсы у
                другого игрока из сундука, который находился на краю привата,
                используя различные методы (по типу труб и тому подобного).
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  3 до 5 дней.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве </span> – бан
                  от 5 до 12 дней.
                </p>
              </li>
              <li>
                2.11. Запрещено создавать публичные варпы в регионах, которые не
                являются безопасными для посетителей и не имеют флага на
                отключения PVP. (при создании PvP арены место, в которое попадут
                игроки при телепортации, должно быть безопасным, а при входе в
                PvP зону, обязательно должны быть соответствующие индикаторы и
                предупреждения о пвп).
                <p>
                  <span className={styles.punishment}>Наказание: </span>{" "}
                  предупреждение создателя варпа.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>
                    В случае отсутствия, либо рецидива:
                  </span>{" "}
                  варп будет удалён.
                </p>
              </li>
              <li>
                2.12. Запрещается строить конструкции, создающие избыточную
                нагрузку на сервер. Администрация оставляет за собой право
                сносить проблемные механизмы без предупреждения, в случае
                обнаружения крайне большой нагрузки, с целью стабилизации работы
                сервера. Просадки FPS не являются нагрузкой для сервера, поэтому
                не рассматриваются как нарушение.
                <p>
                  <span className={styles.punishment}>Наказание: </span>{" "}
                  Предупреждение и 2 часа на демонтаж конструкции, в противном
                  случае - снос.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве</span> - бан от
                  1 часа до 7 дней, если целью было намеренное создание лагов на
                  сервере.
                </p>
              </li>
            </ul>
          </div>
          <div className={styles.blockWrapper}>
            <h1>3. Игровой чат</h1>
            <ul className={styles.block}>
              <li>
                3.1.Запрещено:
                <ul>
                  <li>
                    отправлять одинаковые сообщения с разницей по времени менее
                    60 секунд;
                  </li>
                  <li>отправлять сообщения, не имеющие смысловой нагрузки;</li>
                  <li>провоцировать флуд;</li>
                  <li>использовать капс в сообщениях (кроме аббревиатур).</li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span> мут от
                  30 минут до 3-х часов.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> мут от
                  3 часов до 3 дней.
                </p>
              </li>
              <li>
                3.2. Запрещено:
                <ul>
                  <li>оскорблять игроков и их родственников;</li>
                  <li>
                    оскорблять представителей администрации, сервер или проект в
                    целом.
                  </li>
                  <li>
                    употреблять мат (в том числе завуалированный) и нецензурную
                    лексику в любом виде;
                  </li>
                </ul>
              </li>
              <p>
                <span className={styles.punishment}>Наказание: </span>
                мут от 1 до 24 часов;
              </p>
              <li>
                3.3. Запрещены любые виды попрошайничества, в том числе: просить
                модерацию сменить время суток или погодные условия; просить
                модерацию выровнять территорию; просьбы снять наказание с
                игрока.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  мут от 30 минут до 2 часов.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> мут от
                  2 до 8 часов.
                </p>
              </li>
              <li>
                3.4. Запрещена публичная критика и оспаривание действий
                назначенного персонала.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  мут от 30 минут до 3 часов.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> мут от
                  3 до 24 часов.
                </p>
              </li>
              <li>
                3.5. Запрещено распространять ложные сведения о вайпе.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  мут от 30 минут до 3 часов.{" "}
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> мут от
                  3 до 24 часов.
                </p>
              </li>
              <li>
                3.6. Запрещено спамить запросами на телепорт/флудить в
                лс/оффтопить в личные сообщения членам мод.состава.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  предупреждение & кик с сервера.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> бан от
                  1 до 3 дней.
                </p>
              </li>
              <li>
                3.8. Реклама и продажа:
                <ul>
                  <li>
                    запрещено отправлять сообщения коммерческого характера чаще
                    чем раз в 5 минут.(куплю/продам/обменяю и т.п.);
                  </li>
                  <li>
                    запрещено любыми способами осуществлять рекламу варпа с
                    разницей по времени менее 10 минут, в том числе разных
                    варпов, если фактически они ведут в одну и ту же локацию;
                  </li>
                  <li>
                    запрещено осуществлять рекламу варпа в личных сообщениях
                    игрокам;
                  </li>
                  <li>
                    запрещено осуществлять рекламу одного и того же варпа
                    разными игроками с интервалом менее 10 минут.
                  </li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  По пункту правил 3.1.
                </p>
              </li>
              <li>
                3.9. Сообщения провокационного характера. Запрещено:
                <ul>
                  <li>подстрекать третьих лиц на нарушение правил;</li>
                  <li>отправлять сообщения сексуального характера;</li>
                  <li>обсуждать и пропагандировать сексуальные меньшинства;</li>
                  <li>обсуждать и пропагандировать наркотические средства;</li>
                  <li>угрожать расправой в реальной жизни.</li>
                </ul>
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  мут от 1 до 6 часов.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> мут от
                  6 часов до 3 дней.
                </p>
              </li>
              <li>
                3.10. Запрещены дискуссии на военно-политические темы в любом
                виде их проявления.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  мут от 3 до 24 часов.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве </span> бан от
                  3 дней
                </p>
              </li>
              <li>
                3.11. Запрещена дискриминация по признакам: расы, цвета кожи,
                политических, религиозных и иных убеждений, пола, этнического и
                социального происхождения, имущественного положения, места
                жительства, по языковым или иным признакам.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  мут от 3 до 6 часов.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span> мут от
                  6 часов до 3 дней.
                </p>
              </li>
            </ul>
          </div>
          <h1 className={styles.header}> Правила для категорий игроков </h1>
          <div className={styles.blockWrapper}>
            <h1>4. Общие положения</h1>
            <ul className={styles.block}>
              <li>
                4.0.1. При выдаче наказания (kick, mute, ban) модератор сервера
                обязан указать пункт правил или причину, по которой игрок
                получил наказание. модератор сервера обязан хранить
                доказательства нарушений (за которые он выдал наказания) не
                менее 31-го дня.
                <p>
                  <span className={styles.punishment}>Наказание: </span>В случае
                  отказа в предоставлении доказательств нарушения игроком
                  правил, модератор сервера получает бан от 1 до 7 дней. В
                  случае бана без причины (не корректной причины), получает бан
                  от 1 до 7 дней.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                4.0.2. Модератор сервера имеет право выбирать степень наказания
                в зависимости от тяжести нарушения, в первую очередь опираясь на
                правила и здравый смысл.
              </li>
            </ul>
            <ul className={styles.block}>
              <h1>4.1 Запреты</h1>
              <li>
                4.1.1. Модератору сервера запрещено злоупотреблять донат
                возможностями и командами (убийство игроков с помощью команд,
                выдача наказаний без причины и тд). Запрещено использовать свой
                статус в корыстных целях.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней. При рецидиве - перманентный бан.
                </p>
                <p>
                  {" "}
                  <span className={styles.repeated}>При рецидиве </span> -
                  перманентный бан.
                </p>
              </li>
              <li>
                4.1.2. Модератору сервера запрещено выдавать наказания по
                пунктам правил 4 - 7 (включая все подпункты). Для выдачи
                наказания необходимо обратиться к назначенному персоналу или
                получить разрешение от Главного Модератора.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 3 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
            </ul>
          </div>
          <h1 className={styles.header}>TrueMode</h1>
          <div className={styles.blockWrapper}>
            <h1>5. Общие положения</h1>
            <ul className={styles.block}>
              <li>
                5.0.1. При выдаче наказания (kick, mute, ban) TrueMod обязан
                указать пункт правил или причину, по которой игрок получил
                наказание. TrueMod обязан хранить доказательства нарушений (за
                которые он выдал наказания) не менее 31-го дня, и в случае
                необходимости (по просьбе Главного Модератора) обязан
                предоставить их в соответствующей теме на форуме.
                <p>
                  <span className={styles.punishment}>Наказание: </span>В случае
                  отказа в предоставлении доказательств нарушения игроком
                  правил, TrueMod получает бан от 1 до 7 дней. В случае бана без
                  причины (не корректной причины), получает бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                5.0.2. TrueMod имеет право выбирать степень наказания в
                зависимости от тяжести нарушения, в первую очередь опираясь на
                правила и здравый смысл.
              </li>
              <li>
                5.0.3. TrueMod при выдаче наказания назначенному персоналу
                сервера обязан подать на него жалобу на форуме в разделе для
                жалоб на модераторов.
                <span className={styles.punishment}>
                  <p>
                    <span className={styles.punishment}>Наказание: </span>
                    По пункту правил 6.2.
                  </p>{" "}
                </span>
              </li>
            </ul>
            <ul className={styles.block}>
              <h1>5.1 Запреты</h1>
              <li>
                5.1.1. TrueMod запрещено злоупотреблять донат возможностями и
                командами (убийство игроков с помощью команд, выдача наказаний
                без причины и тд). Запрещено использовать свой статус в
                корыстных целях.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                5.1.2. TrueMod запрещено менять/снимать чужие наказания. Для
                изменения/снятия наказания необходимо обратиться к главному
                модератору или администратору.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 3 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                5.1.3. TrueMod запрещено выдавать наказания по пунктам правил 4
                - 7 (включая все подпункты). Для выдачи наказания необходимо
                обратиться к назначенному персоналу или получить разрешение от
                Главного Модератора.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 3 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
            </ul>
          </div>
          <h1 className={styles.header}>Creative</h1>
          <div className={styles.blockWrapper}>
            <h1>6. Общие положения</h1>
            <ul className={styles.block}>
              <li>
                6.0.1. Creative имеет право игнорировать нарушения других
                игроков.
              </li>
              <li>
                {" "}
                6.0.2. При выдаче наказания (kick, mute, ban) Creative обязан
                указать пункт правил или причину, по которой игрок получил
                наказание. Creative обязан хранить доказательства нарушений (за
                которые он выдал наказания) не менее 31-го дня, и в случае
                необходимости (по просьбе Главного Модератора) обязан
                предоставить их в соответствующей теме на форуме.
                <p>
                  <span className={styles.punishment}>Наказание: </span>В случае
                  отказа в предоставлении доказательств нарушения игроком
                  правил, Creative получает бан от 1 до 7 дней. В случае бана
                  без причины (не корректной причины), получает бан от 1 до 7
                  дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.0.3. Creative имеет право выбирать степень наказания в
                зависимости от тяжести нарушения, в первую очередь опираясь на
                правила и здравый смысл.
              </li>
              <li>
                {" "}
                6.0.4. Creative при выдаче наказания назначенному персоналу
                сервера обязан подать на него жалобу на форуме в разделе для
                жалоб на модераторов.
                <p>
                  <span className={styles.punishment}>Наказание: </span> По
                  пункту правил 8.2.
                </p>
              </li>
            </ul>
            <ul className={styles.block}>
              <h1> 6.1 Запреты</h1>
              <li>
                {" "}
                6.1.1. Creative запрещено злоупотреблять донат возможностями и
                командами (убийство игроков с помощью команд, выдача наказаний
                без причины, дестабилизация экономики, раздача ресурсов и тд).
                Запрещено использовать свой статус в корыстных целях.
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.1.2. Creative запрещено менять/снимать чужие наказания. Для
                изменения/снятия наказания необходимо обратиться к главному
                модератору или администратору.
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 до 3 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.1.3. Creative запрещено дестабилизировать работу сервера
                (Бессмысленные постройки, вызывающие лаги, раздача ресурсов и
                т.п.).
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.1.4. Creative запрещено участвовать в игровом процессе
                (Торговля, пвп и т.д.).
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.1.5. Creative запрещено добавлять в свои приваты игроков и
                быть участником в чужих приватах. Исключением является игрок,
                отказывающийся принимать участие в игровом процессе. Добавление
                такого игрока возможно с одобрения Главного Модератора.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.1.6. Creative запрещено передавать игровые ценности из вкладки
                креатива игрокам (исключением являются строительные ресурсы,
                которые не дают ускорения в развитии и игроки, живущие в одном
                привате с Creative).
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                {" "}
                6.1.7. Creative запрещено выдавать наказания по пунктам правил 4
                - 7 (включая все подпункты). Для выдачи наказания необходимо
                обратиться к назначенному персоналу или получить разрешение от
                Главного Модератора.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 3 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>
                  перманентный бан.
                </p>
              </li>
            </ul>
          </div>
          <h1 className={styles.header}>Admin</h1>
          <div className={styles.blockWrapper}>
            <h1>7. Общие положения</h1>
            <ul className={styles.block}>
              <li>
                7.0.1. Admin имеет право игнорировать нарушения других игроков.
              </li>
              <li>
                7.0.2. При выдаче наказания (kick, mute, ban), Admin обязан
                указать пункт правил или причину, по которой игрок получил
                наказание. Admin обязан хранить доказательства нарушений (за
                которые он выдал наказания) не менее 31-го дня и в случае
                необходимости (по просьбе Главного Модератора) обязан
                предоставить их в соответствующей теме на форуме.
                <p>
                  <span className={styles.punishment}>Наказание: </span>В случае
                  отказа в предоставлении доказательств нарушения игроком
                  правил, Admin получает бан от 1 до 7 дней. В случае бана без
                  причины (не корректной причины) получает бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                7.0.3. Admin имеет право выбирать степень наказания в
                зависимости от тяжести нарушения, в первую очередь опираясь на
                правила и здравый смысл.
              </li>
              <li>
                7.0.4. Admin при выдаче наказания назначенному персоналу сервера
                обязан подать на него жалобу на форуме в разделе для жалоб на
                модераторов.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  По пункту правил 10.2.
                </p>
              </li>
            </ul>
            <ul className={styles.block}>
              <h1>7.1 Запреты</h1>
              <li>
                7.1.1. Admin запрещено злоупотреблять донат возможностями и
                командами (убийство игроков с помощью команд, выдача наказаний
                без причины, дестабилизация экономики, раздача ресурсов и тд).
                Запрещено использовать свой статус в корыстных целях. Запрещено
                выдавать любые права прочим игрокам (/god, /gm и т.п.)
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                7.1.2. Admin запрещено менять/снимать чужие наказания. Для
                изменения/снятия наказания необходимо обратиться к главному
                модератору или администратору.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 3 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                7.1.3. Admin запрещено дестабилизировать работу сервера
                (бессмысленные постройки, вызывающие лаги, раздача ресурсов).
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                7.1.4. Admin запрещено участвовать в игровом процессе (торговля,
                пвп и т.д.).
                <p>
                  <span className={styles.punishment}>Наказание: </span> бан от
                  1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                7.1.5. Admin запрещено добавлять в свои приваты игроков и быть
                участником в чужих приватах. Исключением является игрок,
                отказывающийся принимать участие в игровом процессе. Добавление
                такого игрока возможно с одобрения Главного Модератора.
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
              <li>
                7.1.6. Admin запрещено передавать игровые ценности из вкладки
                креатива игрокам (исключением являются строительные ресурсы,
                которые не дают ускорения в развитии и игроки, живущие в одном
                привате с Admin).
                <p>
                  <span className={styles.punishment}>Наказание: </span>
                  бан от 1 до 7 дней.{" "}
                </p>
                <p>
                  <span className={styles.repeated}>При рецидиве: </span>{" "}
                  перманентный бан.
                </p>
              </li>
            </ul>
          </div>
        </div>
        <div className={styles.right}>
          <motion.div
            className={styles.imageWrapper}
            transition={{
              repeat: Infinity,
              repeatType: "reverse",
              duration: 0.8,
              ease: "easeInOut",
            }}
          >
            <Image src={Img} alt={""} fill={true} />{" "}
            {/*Пусть эндермен телепортируется от блока к блоку при прокрутке?*/}
          </motion.div>
        </div>
      </div>
    </section>
  )
}

export default Rules
